app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
---
  def movies_same_director
    @movie   =  Movie.find(params[:id])